## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_security_group_rule.client_vpn_ingress_database`          |
|        | `module.rds_cluster.aws_security_group_rule.rds_proxy_egress`  |
|        | `module.rds_cluster.aws_security_group_rule.rds_proxy_ingress` |
| update | `aws_rds_cluster_parameter_group.enable_audit_logging_v8`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging_v8 will be updated in-place
  ~ resource "aws_rds_cluster_parameter_group" "enable_audit_logging_v8" {
        id          = "wordpress-aurora-mysql8"
        name        = "wordpress-aurora-mysql8"
        tags        = {}
        # (5 unchanged attributes hidden)

      - parameter {
          - apply_method = "immediate" -> null
          - name         = "server_audit_events" -> null
          - value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML" -> null
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "server_audit_logging" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "server_audit_logging"
          + value        = "1"
        }

        # (1 unchanged block hidden)
    }

  # aws_security_group_rule.client_vpn_ingress_database will be created
  + resource "aws_security_group_rule" "client_vpn_ingress_database" {
      + description              = "Client VPN ingress to the database"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-03f4f613cd728faf0"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d61efb4e9ab60608"
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds_cluster.aws_security_group_rule.rds_proxy_egress will be created
  + resource "aws_security_group_rule" "rds_proxy_egress" {
      + description              = "Proxy egress from the database"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-03f4f613cd728faf0"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "egress"
    }

  # module.rds_cluster.aws_security_group_rule.rds_proxy_ingress will be created
  + resource "aws_security_group_rule" "rds_proxy_ingress" {
      + description              = "Proxy ingress to the database"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-03f4f613cd728faf0"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
